{"_id":{"$oid":"5e7907474a029f4294b65e60"},"number":{"$numberInt":"1"},"title":"Dark Stranger","content":"The big mother hen sat restlessly in the corner of the small chicken pen. Her young ones stirred restlessly under her feathers. Outside the darkness grew. The storm fiercely raged on. The lightning slashed across the sky illuminating parts of the chicken pen and the thunder roared across the lands. It was a stormy cold night and the big mother hen worried for her little ones. They were only a day old with hardly any feathers on their tiny little bodies. \r\n\r\nThere was a squeak outside, maybe a twig breaking and then a loud bang! The door to the chicken pen flew open causing the big mother hen to rise in panic and move further back in the corner. She could hear her little ones echo her sudden fear and move about her restlessly. There in the doorway stood a dark mass, a man with a wide toothless grin on his face. He was tall and dark, with a pointed hat on his head and a cloak that went up to the big boots on his feet. He held a strong light to the mother hen almost blinding her.\r\n\r\nThe stranger reached out a hand and grabbed the big mother hen, he tucked her under his arm and exited the ban. The big mother hen felt her young ones fall away from under her feathers. Their cries were a bare whisper, as the storm drowned out their voices.\r\n","picture":""}
{"_id":{"$oid":"5e79d40a0fe9f92b6840a6d9"},"number":{"$numberInt":"2"},"title":"The Midnight Thief","content":"She turned and twisted to free herself as the dark stranger started to race amidst the stormy weather but he held his grip on her. He ran like the wind, jumping over ditches and muddy ponds on his way. He ran over valleys and hills, through forests and thickets, over bridges and across rivers. Not once did he stop to catch his breath, not once did he stop to rest his feet and not once did he loosen his grip on the big mother hen.  \r\n\r\nThe night turned colder and the moon crept out from under the clouds. The storm turned into a slight drizzle and the blanket of the night began to fall away. Just as dawn was approaching the stranger slowed down and almost suddenly stopped right in front of a wooden door. He opened the squeaky wooden door and sent the big mother hen flying inside then quickly shut the door behind him.\r\n","picture":""}
{"_id":{"$oid":"5e7c69ef73726433d8279737"},"number":{"$numberInt":"4"},"title":"Crooooak","content":"The room was now bright and she could see that she was in a big barn. Its floor was covered in chicken dropping that had was so thick you couldn’t begin to scratch through it. It had a low ceiling, one door and one big old caged window from which you could see the sun come up but never go down. At the end of the barn, the crowd was growing, all the birds seemed to be huddled around what seemed like… a human, a skinny boy with a back bent towards what seemed to be troughs. He was putting food in the troughs while all the birds struggled to get first peck. The farmer finished with his work, made his way to the door kicking the hens in his way aside. He exited and shut the door behind him leaving the birds still fighting among themselves for the few grains of food.\r\n\r\nThe big mother hen was still watching from his spot when she heard a loud shuttering noise behind her. She quickly spun around and found herself staring at the biggest cock she had ever seen. His feathers were a fiery red, and he had a comb that covered almost half his face. The dust rose high in the air as he got up from the corner he had been resting in. He yawned loudly, stretched his feet behind him, flapped his wings and gave the loudest crooooak!\r\n"}
{"_id":{"$oid":"5e7c6e2e73726433d8279738"},"number":{"$numberInt":"3"},"title":"Chaos","content":"The Big Mother Hen was momentarily blinded and she remained glued to the spot he had landed. A gash of stinking rotten air hit her hard on the face and as the darkness lifted from her eyes, she started to look around and realised that if such a place as hell existed , then this was it. She could hear the sound of feet, of maybe a hundred or so creatures approaching her. Their faces were partly illuminated given the darkness in the barn. They were approaching from the dark, slowly closing in around the big mother hen from all sides. The earth seemed to spin around the Big Mother Hen as she turned her head this way and that way to try and keep up with what was happening around her. \r\n\r\nThe darkness was falling away behind them, their features starting to become clear. Fear was quickly building up in the big mother hen’s chest and she could literally hear the sound of her heart beating. She threw a wing over her eyes as the radius zeroed down. \r\n\r\nBang! A momentarily second of quietness and then chaos. The big mother hen opened her eyes and to her surprise the creatures all seemed to be running away from her or past her. And they were not just creatures, they were hens, cocks, ducks and she was pretty sure she saw a turkey.\r\n"}
{"_id":{"$oid":"5e7c72c973726433d8279739"},"number":{"$numberInt":"5"},"title":"Kings and Worms","content":"The noise in the barn stopped suddenly and the whole barn seemed to freeze over.\r\n\r\n“Who is that?’’ the Big Mother Hen asked more to herself than to any one in particular.\r\n\r\n“That is ‘Argo’, King for now and no later” replied  a skinny hen at her side she hadn’t yet noticed.\r\n\r\n“Kings?” asked the Big Mother Hen.\r\n\r\n“Yes, kings in a barn. There have been a whole bunch of them before him. They eat as much as they want, drink all the water and lie around all day while the turkeys fun the heat off them. And at the end of their regime, the farmer rewards them with paradise, “Said Skinny in her shriveling voice.\r\n\r\n“What is paradise?” Asked the Big Mother Hen.\r\n\r\n“Well I’ll tell you what paradise is,” she said, “it’s freedom, and happiness. You get to see the sun set again, bathe in dust, eat worms and breathe fresh air. The worms,  I miss  worms.”\r\n\r\n“Hey!” The Big Mother Hen called to Skinny who seemed to be drifting into some kind of trance.\r\n\r\n“Ooh! I am sorry, paradise. Sweet sweet paradise is out through those doors. But you have to be king first.” \r\n\r\n“Can’t you just walk out, like when the farmer comes in,”\r\n\r\n“Walk out; you’d think no one has thought about that, wouldn’t you. You think we are dumb sitting ducks with a sealed fate. Look around friend, the only way you're leaving this place is with the farmer’s guiding hand when you are done being king which for your case is never, so sit back and enjoy the ride.” \r\n"}
{"_id":{"$oid":"5e7c7adb73726433d827973a"},"number":{"$numberInt":"6"},"title":"Days at the Barn","content":"The life seemed to drain out of her face, what about her little ones, yellow, brownie and the whole bunch of them, and Kiki who was so little, would she get to see any of them again, had they even survived the night, she wondered. She looked backed at the end of the barn. The king, Argo was gladly eating away at the food. All the other animals stood back and watched him with salivating mouths, swallowing every time he swallowed and wishing every time he pulled his head out of the trough that he was done and each time, they were disappointed. It seemed like Argo would never get full. He pecked and pecked, gave a big fat burp, then pecked some more and all the while the rest the fowl greedily and hungrily watched. \r\n\r\nThe days at the barn were long and hush, but the nights were even worse. The birds not only fought for food but also fought for space, water, a dry place to sleep and they pecked away at one another eating the feathers off each other’s skins. The nights were too cold, and the days too hot. Each night the Big Mother Hen went to sleep, and each night she woke up screaming. Every time she closed her eyes, she’d see the dark stranger on that fateful night; she would hear the screams of her chicks, wings reaching out but never touching. The only difference was that this time the stranger did not grab her, he grabbed her little ones. She found herself reciting their names to herself more for reassurance than remembrance. And every day the farmer came in, she watched the door, thinking about how easy it could have been to just walk out.\r\n"}
{"_id":{"$oid":"5e7c7d2573726433d827973b"},"number":{"$numberInt":"7"},"title":"\"He likes you\"","content":"The days dragged by, the Big Mother Hen became skinnier and skinnier, and all the while the king got bigger and bigger. The farmer came on his special day and took him by the wings and led him out the magical doors just like Skinny had predicted. The others watched on with both admiration and jealousy. With the old king gone the birds fought one another for the privileged title. They plucked feathers off their behind and threw them in the ring to enter the big race and two by two they fought each other to near death until the ultimate undefeated champion was found.\r\n\r\nThe new king was a white cock. He stepped with pride and grace to be sworn to leadership. The Big Mother Hen watched the proceeding with complete and utter disinterest.  She wallowed away in her corner in quite agony of the life she was being forced to lead. She ate the scraps that were left after other birds were done fighting over the first peck. She hardly noticed the days go by nor did she notice the look in the king’s gaze or the hesitation in his step every morning he made his majestic way to the troughs.\r\n\r\n“He likes you!” said Skinny one day in a singing voice as the king made his way to the  troughs giving his now casual look.\r\n\r\n“Who does?” asked the disinterested Big Mother Hen.\r\n\r\n“The king” replied Skinny “if I were you, not that I’d be you, I’d look at that as my ticket out of here. He is the king. If u were his queen, you’d be feeding as well as him. And he looks honorable, so my dear, no harm no fowl.\r\n\r\nThe Big Mother Hen thought it over. The king seemed to be the only one who could win the farmers’ favor. Maybe when the time was right he would convince the farmer to take her too.\r\n\r\nWith all this in mind the Big Mother Hen suddenly started to see the light at the end of the tunnel. She wiped the sad grin off her face and began to take note of the king. she batted her eyes back at him and gave him the most charming of smiles. Every morning as he passed she’d stand gracefully spreading out her feather so he could see the bright colors hidden and giving the most musical crooooak, croak  in the barn. This the king took note of, and sooner than later on one merry morning he stopped right in front of her on his way to the troughs.\r\n"}
{"_id":{"$oid":"5e7c7f4073726433d827973c"},"number":{"$numberInt":"8"},"title":"Queen Mother Hen","content":"“Tell me my dear,” said he “what is a shiny princess like you doing here among the common fowl.”\r\n\r\nThe Big Mother Hen bowed her head feeling suddenly shy and taking note of all the gazes from all the birds directed at her.\r\n\r\n“I, king of this rotten old barn, say to you all, I have seen beauty for I have been to so many places. But today I see a beauty with none to compare,” said the king loudly to the barn fowl. “I hereby take this lovely beauty to be my queen. She’ll stand where I stand and eat where I eat.”\r\n\r\nThere was a moment of chaos as all the fowl were opposed to what the king had said. They spit and stamped their feet in disagreement.\r\n\r\n“Silence,” shouted the king. “Who dares question my rule. Let him step up and face his doom.”\r\n\r\nThe noise quickly died down in unspoken surrender. The king took the Big Mother Hen by her wing and led her to walk right in front of him to the troughs.\r\n"}
{"_id":{"$oid":"5e7ca02e0100c24e50f8cefa"},"number":{"$numberInt":"9"},"title":"The One Who Got Mad","content":"Life at the barn became bearable. The Big Mother Hen was treated like the queen that she was. She had servants at her beckoning. The turkey fanned her during the day to keep the heat off her and the guinea fowl picked the dirt out of her feet. And best of all she had the pigeon ordered by the king to paint her face on the ragged ceiling where the history of the pen had been written by kings that ruled before. The pigeon was the only bird in the barn that could fly. Why she never flew away, no one knew. \r\n\r\n“On this wall are all the great birds that have passed through this barn” said the pigeon, “this here is our history and you my lady get to be a part of it. As you can see, you’re the second lady to have your face upon the wall.”\r\n\r\n“I see you’ve gotten yourself to the big wall,” the Big Mother Hen turned around to see Skinny walking toward her. “Sneaky as usual. Just be careful as you tread.”\r\n\r\n“Who is the other hen,” asked the Big Mother Hen.\r\n\r\n“Ooh her, she was a queen.” replied Skinny. “The only queen this barn ever had. She ruled like no other. White queen they called her because she had the whitest feathers any one had ever seen.” \r\n\r\n“What happened to her? Did she go to paradise?” Asked the Big Mother Hen.\r\n\r\n“No one really knows, some say she become mad, others say she did go to paradise, for a few seconds, then came back totally changed.”\r\n\r\n“You’re the oldest here, you must know, what did happen to her?”\r\n\r\n“I’d like to think that she found peace and freedom.” \r\n"}
{"_id":{"$oid":"5e7ca1df0100c24e50f8cefb"},"number":{"$numberInt":"10"},"title":"Stairway To Paradise","content":"The days carried on, each day the Big Mother Hen seemed to be holding her breathe. It was not going to be long before the farmer came to take the king to paradise. The king didn’t speak about the future, about paradise. Was she there with him, the Big Mother Hen often wondered? Did he plan to take her along and was she ever going to have her freedom back. With each passing day, the weight of her anxiety grew and her nightmares became more vivid. More and more times she found herself reciting the names of her little ones to herself until it became some kind of a song.\r\n\r\nThe night before the promised day the king called on to her. “My queen my beloved,” said he. “Tomorrow the farmer comes, and the thought of leaving you in this god-forsaken-place tears at my heart. You will succeed after me and when your time is right, the farmer will bring you to  join me in paradise. My world wouldn’t be paradise without you in it.”\r\n\r\nThe bells were going off in the distance. The king kept tapping his leg out of anxiety, all the fowl waited in anticipation to give him a send off to paradise.  Beads of sweat rolled down the Big Mother Hen’s face. This was the day. \r\n\r\nThe farmer came in as usual, with his sharp hat on his head and his cloak that went all the way to his filthy boots. He wore a toothless grin on his face like the one he had on the night he captured the Big Mother Hen. The Big Mother Hen swallowed hard as he approached. In the corner of the Big Mother Hen’s eyes she could see the other hens paving way for the farmer as he made his way to where the Big Mother Hen stood next to her king. The farmer scooped down and grabbed the king by the wing examined him from top to bottom, looked down at the Big Mother Hen then back at the king. He then reached out his other big hand and grabbed the Big Mother Hen as well. He examined her too.\r\n\r\n”This is it,” thought the Big Mother Hen. The farmer seemed to be comparing them against each other or weighing them, one could not really tell. He looked at them up close, raising one by one to his eyes level and then all of a sudden, he dropped the king, opened the big squeaky door and made his exit with the Big Mother Hen in his hand. The Big Mother Hen could hear the sudden chaos that rose as the farmer exited the barn. \r\n\r\n“You betrayed me,” she heard the king shout as he threw himself at the shutting door. The disappointed look in his face was the last thing she saw as the door shut.\r\n"}
{"_id":{"$oid":"5e7ca3c30100c24e50f8cefc"},"number":{"$numberInt":"11"},"title":"Blood!","content":"A gash of fresh air hit the Big Mother Hen the moment the farmer led her out. She had almost forgotten what fresh air, sun rays and a cold breeze felt like caressing through her feathers. She breathed out deeply not caring to remember at what point she’d started to hold her breathe. After the hell she’d been through, this was indeed paradise despite what she’d had to do to get there. \r\n\r\nThe farmer still held her tightly and by the looks of it he was leading her towards the edge of the farm, to freedom, to her chicks so it didn’t make much sense when he suddenly stopped. The Big Mother Hen looked around in wonderment. There, right in front of the farmer was a big old stump with an axe dug into it. It was a rusty old axe with blood tickling down the axial. She looked down to the stump, it was all red.\r\n\r\n“Blood!” she cooed out loudly. Her heart began to race as she grasped the picture before her eyes, started to see the pile of feathers just by the tree stump, the blood stained deep in to the ground, the bucket of steaming hot water, the heads, more like skulls and finally the axe. The axe that would be used to decapitate her as well. \r\n\r\n“This was no paradise,”she thought as she started to struggle against the farmer’s firm grip but by this time the farmer was already holding her down, nailing her helplessly to the tree stump with his boots and raising the axe above her head ready to put an end to the story of the Big Mother Hen.\r\n\r\nThe farmer raised the axe stretching out with all his might and brought the axe right next to the Big Mother Hen’s head. He then bent to look just behind the Big Mother Hen.\r\n\r\n“Ooh my,” said he, “your one lucky fella.” \r\n"}
{"_id":{"$oid":"5e7e1c726514e737b87197a6"},"number":{"$numberInt":"12"},"title":"Skinny's Plan","content":"The Big Mother Hen looked up at him and in his hands he held the biggest egg she had ever seen. It was a shinny egg, so smooth as the farmer inspected it in his hand. She could almost hear the life forming inside it. But at the moment a new thought was in her mind. The farmer had completely let go of her. So mesmerized by the egg, he had completely forgotten about the Big Mother Hen. This was a window of opportunity. She could get right up run out over the fence and be gone before the farmer could catch up to her. \r\n\r\nSo she did the next thing her instincts told her to do. She gathered her wits and started to run blindly towards the fence. Behind her, she heard the farmer coming right behind her. Images were forming in her mind, what about the others. Skinny, the king, she had to tell someone, she had to tell someone that paradise was actually a slaughter house. She began to slow down and it was not long before the farmer grabbed her by the wings.\r\n\r\n“With such lovely eggs you’re going to earn back your life,” said the farmer as he led the Big Mother Hen back to the barn.\r\n\r\nHer first sight as the farmer opened the door to the barn was the king. \r\n\r\n“Paradise is not for cheats, you betrayer,” he was shouting as the farmer dropped the Big Mother Hen and picked up the king.\r\n\r\n“It’s a trap, don’t go, it’s a trap ,”she shouted above the chaos that had suddenly rose with her entry but it was too late, for the king was joyfully being led to paradise. The Big Mother Hen slapped herself against the slamming door and began to beat at it. She could feel every one’s eyes on her. No one seemed to understand the truth in what she was saying. Everyone thought she was fighting to go back to paradise.\r\n\r\n“It’s a trap” she said to the blank faces that starred at her “it’s a trap,” she kept on saying, scanning the room to see if any one believed her. She saw nothing, nothing; no one seemed to believe her except Skinny who seemed to be nodding at her assuredly. She started to make her way towards Skinny, noticing her featherless neck  the weary look in her eyes ,that distant look in her eyes – she must have known, she must know, and what about the pigeon, the pigeon that could fly in and out of the barn at  will. Someone had to have known.\r\n\r\n“Why?” she said as she stood in front of Skinny “why didn’t you warn us.”\r\n\r\n“Let me show you something,” said Skinny as she gently led her right in front of the wall with all the history and painting of great leaders. “That right there is me, the great queen that once ruled.”\r\n\r\n“That’s you?  Why didn’t you tell anyone? Why didn’t you tell me it was hell?”\r\n\r\n“The hope of freedom is what keeps us alive here. What are we left with when we take that away. They need it. You needed it. It keeps us going.”\r\n\r\n“You said you found your freedom but this is no freedom. Freedom is out there, just a small path away from hell and am going to find it,” said the Big Mother Hen as she walked towards the centre of the room. \r\n\r\n‘Everyone! Listen up every one, there is no paradise”, she shouted on top of her voice. “There is no paradise.”\r\n\r\n“They will not believe you,” said Skinny who stood at her side. “They will not listen.”\r\n\r\n‘Then make them listen, they have got to know, they have a right to know.” pleaded the Big Mother Hen.\r\n\r\nAnd so Skinny walked right up to the centre of the barn scratching her nails on the wall as she slowly made her way. The barn quieted down at the screeching sound and every one turned their attention to Skinny.\r\n\r\n“For so long the farmer has taken advantage of our arrogance and ignorance,” she said. “And we were too weak minded to see it.”\r\n\r\n“Who are you to make this sort of accusations?” asked Paddy a fowl looking hen. “The farmer has been nothing but kind to us. He gives us food and water and he lets one of us leave to go to paradise.”\r\n\r\n“Paradise!” said the Big Mother Hen, “there is no paradise, just a tree stump and an axe that the farmer uses to chop our heads off.”\r\n\r\nAll birds looked at the Big Mother Hen in unanticipated horror. “I have been outside these walls and back and I can honestly tell you that what I saw there was the opposite of paradise. For as long as we let the farmer control our destiny, the only thing that awaits us is death.” The whole barn was now quiet, all the birds were listening to the words of the Big Mother Hen with a look of unspoken fear in their eyes.\r\n\r\nWhat do we do we do then?”asked Paddy.\r\n\r\n“We seize our freedom,” replied someone in the crowd.\r\n\r\n“We attack the farmer,” replied another.\r\n\r\n“He is too strong for us,” said Skinny. “The farmer only eats those of us who are fat. If we stop eating the farmer will not want us for his dinner any more.”\r\n\r\n“And how do we know this will work?” asked again Paddy.\r\n\r\n“Because its how I have survived all these days. In my day I became the first hen to rule this barn and like all those before me I waited for my day of freedom. As promised, the farmer came for me and led me out straight to the tree stump. I  only survived because I laid an egg. But in the days that followed I could not eat for worry of my life, I grew small and reduced in mass and that’s how I survived the axe of the farmer.’’\r\n"}
{"_id":{"$oid":"5e7e25166514e737b87197a7"},"number":{"$numberInt":"13"},"title":"The Battle of The Old Rotten Barn","content":"Everyone seemed to agree with the plan to eat as little as possible and in the days that followed no food was touched. The farmer came in from time to time and it puzzled him that the food was left uneaten.\r\n\r\nThe farmer came to take an egg from the Big Mother Hen every day and the mother hen mourned of each egg because it represented a child she’d never get to meet. The plan seemed to be working well though because the farmer had a worried look on his face. He came to the barn when the day bells went off and looked around the barn. All the hens seemed to have lost weight. “They must be sick,” he murmured and then looked around for the sickliest of the birds. That day he picked out five birds that he took to the axe.\r\n\r\nHis exit was followed by cries and mourns and blame to Skinny for her solution to the whole episode. The birds gathered around Skinny to ask about how the plan went wrong.\r\n\r\n“It’s all your fault,” they said. “We were better off not knowing, now we live in worry thinking about what awaits us.”\r\n\r\nThere has to be a solution,” said the Big Mother Hen, “freedom is not to be given by the farmer. We have to take it, forcefully. We will unite our strengths. We will fight off the farmer and to do that we have to be prepared.” By this time the Big Mother Hen had gained the confidence of the barn. Everyone was stumping their feet in agreement.\r\n\r\nIt was going to be a while before the farmer could take any of them again so they sharpened their crawls and beaks and ate as much as possible. The farmer came in every day to pick the eggs that the Big Mother Hen laid and for every egg the farmer took, the Big Mother Hen mourned the chick she would have been and the hen she could have become. \r\n\r\nThe days rolled by and the long awaited day came. Every bird stood ready to strike. Beaks and claws were fully sharpened. The pigeon was flying outside ready to give the signal. When the farmer approached the barn, the turkeys stood at the door ready to keep it open the moment the farmer came in.\r\n\r\nThe farmer came in as usual swinging a bucket in one hand and a can of water in the other. The moment he opened the door the turkeys attacked him. He dropped the food and water and kicked at the turkeys that were attacking him. The pigeon flew in and attacked his face. The farmer started trying to wave off the pigeon while kicking at the birds that were now fully rounded up around him. He tried to run outside the door but tipped over the bucket and fell flat on his face.\r\n\r\n“Get off me you stupid birds,” he shouted as the bird raced outside the door stepping on the farmer as they made their exit. There was noise every everywhere, shouts of freedom as the birds ran to their freedom.\r\n"}
{"_id":{"$oid":"5e7e29796514e737b87197a8"},"number":{"$numberInt":"14"},"title":"Running for Freedom","content":"“We did it,” shouted the Big Mother Hen the moment she stepped outside. Skinny was at her side and the pigeon was flying right above them. She looked back at the barn, her old prison. The farmer was getting up. He was headed straight for them. “He’s coming, we’ve got to run,” she said as she prompted Skinny up and together they started to run towards the edge of the fence.\r\n\r\n“This way,” said the pigeon as she led the way. Behind them they could see the farmer being joined by three other people and together they started to round up the birds, trapping them with big nets and throwing them back inside  the barn. The Big Mother Hen ran as fast as her legs could carry her with Skinny right behind her. They made it past the fence and headed right for the forest. They kept on running until Skinny suddenly collapsed. The Big Mother Hen stopped and ran up to Skinny to see what was wrong.\r\n“I guess am not as strong as I used to be,” she said breathlessly.\r\n“We can’t afford to stop,” said the pigeon landing right next to Skinny.” the farmer is right behind us.\r\n\r\n“I can’t go on, my heart is weary,” Skinny said weakly and for the first time the Big Mother Hen started to see the weary lines around her eyes, the  drooping feathers and the dimness in her eyes.\r\n\r\n“I can not leave you here,” she said.\r\n\r\n“The farmer is coming,” the pigeon was now shouting her emphasis.\r\n\r\n“We are only a step away from our freedom. You cannot give up now.’’\r\n\r\n“He’s coming.”\r\n\r\n“I think this is freedom enough for me. I have nothing to go back to but you do. Go home to your family. Go.”\r\n\r\n‘Take care of her,” she said to the pigeon as she got up.\r\n\r\n“Run straight ahead, follow the sun,” said the pigeon.\r\n\r\nThe Big Mother Hen started to run. The last thing she saw was the farmer picking up Skinny and the pigeon shooting for the sky. She could hear the echo of Skinny’s hashed voice as she urged her to run faster.\r\n"}
{"_id":{"$oid":"5e7e2de26514e737b87197a9"},"number":{"$numberInt":"15"},"title":"Home Sweet Home","content":"She ran as fast as she could, tears were rolling down her face blinding her but she could hardly feel them. Grass and trees slashed at her but she kept right on running. She ran like the wind and with the wind, jumping over mud ponds and rivers. She ran blindly and fiercely still hearing the last words Skinny had said to her. Run! She hardly noticed the scorching sun or the prickling in her feet. She ran like never before and kept right on running. The sun was sinking in the west when she eventually gave in to the weariness and collapsed into a tired dreamless sleep.\r\n\r\nThe Big Mother Hen was awoken by the ticklish feeling on her face. She opened her eyes to see a tiny chick with barely a feather nibbling at her face.\r\n\r\n“Where did you come from?” She said getting up. The sun was high up in the sky and the air was fresh with the morning dew. The Big Mother Hen looked around her to get a sense of where she was.  She was just at the slope of the hill. Down below she could see the valley, the small farm and the rest of them. Her chicks! She was home. She knew these fields, she had once fed around these fields. And those had to be her babies, her chicks.\r\n\r\n“Yellow!” She said to the little one at her side.\r\n\r\n“Coo!” Replied she.\r\n\r\n“You survived! You survived,” she cried out her voice rising. She started to race down the hill towards the rest of them. “My chicks, they survived,’’ she shouted as she ran towards them. They were all there, all of them, feeding by the hillside unattended. They didn’t seem to be a day older than they were the night she left. But it didn’t matter to her then. All the things she  had had to go through to get back home didn’t matter to her then. Her heart was heaving with joy. Her chicks had lived to see her get home.\r\n\r\nShe was almost reaching them when another hen jumped right in front her.\r\n\r\n“Hey slow down,” she said, “Where are you headed?’’\r\n\r\n“My chicks!” she said joyfully. “After all this time, they survived.”\r\n\r\n“Those chicks?” said the new comer.\r\n\r\n“Yes my chicks ,they survived ,look at them.”\r\n\r\n“Those are my chicks,” said the brown hen who was now putting on a somewhat serious face.\r\n\r\n“No, those are my chicks, I could never forget those faces.”\r\n\r\n“Those are my chicks and you are going to have to go through me to get to them,” said the brown hen now stretching her neck and drawing out her nails. She attacked the Big Mother Hen and before they knew it they were fighting scratching at each other’s face. The Big Mother Hen fought with all her might until she managed to pin the other hen to the ground. But just as she brought her final blow she realized something. She knew this hen, she knew those eyes.\r\n\r\n“Brownie?” She said questioningly as she stepped back.\r\n\r\n“What?” replied the other hen with a puzzled look.\r\n\r\n“I know you.”\r\n\r\n“Ma?” Said the other hen now getting up.\r\n\r\n“Brownie” the Big Mother Hen said in a now excited voice.\r\n\r\n“It’s Yellow actually, but that does not matter now. Your back!” said Yellow now excited as well.\r\n\r\n“But you’re not yellow, you’re brown. And you’re big. Where is Brownie, where are all the others?” she said looking around at the fields.\r\n\r\n“They never made it mother. Willie, Crazy and Kiki did not survive the storm that night. The rest of us waited around for you, praying each day that you would safely return home. We lived  with the hope that you would one day come back, and then there was a flu that broke out. Brownie, Sleek and I survived for most part of it but then the kite came and took off with them. I am the only one that survived.”\r\n\r\n“ But Featherlight, she was a strong-, and Kiki, Kiki-?” she was stammering, and she could feel the tears begin to form in her eyes as she tried to hold them back.\r\n\r\n“Mother!” Pleaded Yellow. “I lived to see you back. All else does not matter. Your  home now.”\r\n\r\n“Your right,” she said wiping the tears off  her face, “I am home. And I have you. I am glad you’re here to see me home. And these are…?”\r\n\r\n“Your grandchildren, named them after all the others. That’s Yellow over there, she going to be a real trooper, and that’s Whitie, Sleek, Kiki, and oh, that’s Crazy, she is crazy. I can not get her to walk in a straight line. She’s always bumping into things. And that over there is Flicker. She thinks she’s going to learn how to fly.” The Big Mother Hen looked at them and all the emptiness of loss she’d started to feel and the weight of her loss seemed to be lifting as she looked at the little ones. She was home.\r\n\r\n“Come let me show you the old house. They put a new door,” said Yellow as she gently guided her to the old chicken pen with her young ones racing on ahead of them. Together they walked off towards home telling each other of all the adventures they had encountered since they had last seen each other.\r\n\r\nTHE END\r\n"}
